In [1]:
import pandas as pd
import numpy as np

In [103]:
data=pd.read_csv("StudentsPerformance.csv")

In [3]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [26]:
df=data.groupby("gender").count()

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
gender,,,,,,,
female,518,518,518,518,518,518,518
male,482,482,482,482,482,482,482

In [32]:
df2=data.groupby("gender").groups

In [33]:
type(df2)

pandas.io.formats.printing.PrettyDict

In [34]:
df2

{'female': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...], 'male': [518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, ...]}

In [38]:
len(df2["female"])

518

In [76]:
df3=data.groupby("race/ethnicity")["math score","reading score","writing score"].mean()

C:\Users\visha\anaconda3\envs\old\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [77]:
df3

                math score  reading score  writing score
race/ethnicity
group A          61.629213      64.674157      62.674157
group B          63.605263      67.568421      66.100000
group C          64.272727      69.181818      67.827586
group D          67.148855      69.877863      70.030534
group E          73.821429      73.028571      71.407143

In [80]:
df3.reset_index(inplace=True)

In [81]:
df3

  race/ethnicity  math score  reading score  writing score
0        group A   61.629213      64.674157      62.674157
1        group B   63.605263      67.568421      66.100000
2        group C   64.272727      69.181818      67.827586
3        group D   67.148855      69.877863      70.030534
4        group E   73.821429      73.028571      71.407143

In [93]:
df4=data.groupby("test preparation course")["math score","reading score","writing score"].mean()

C:\Users\visha\anaconda3\envs\old\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [94]:
df4

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [95]:
df5=data.groupby("race/ethnicity")["math score","reading score","writing score"].std()

C:\Users\visha\anaconda3\envs\old\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [96]:
df5

                math score  reading score  writing score
race/ethnicity
group A          14.523008      15.543762      15.468278
group B          16.235925      15.573789      15.681536
group C          15.451209      13.967331      14.983378
group D          14.070593      14.070171      14.519607
group E          15.534259      14.874024      15.113906

In [97]:
df6=data.groupby("test preparation course")["math score","reading score","writing score"].std()

C:\Users\visha\anaconda3\envs\old\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [98]:
df6

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,female,group C,some high school,free/reduced,none,0,17,10
1,1,female,group B,high school,free/reduced,none,8,24,23
2,2,female,group B,some high school,free/reduced,none,18,32,28
3,3,female,group B,some college,standard,none,11,38,32
4,4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...,...
995,995,male,group E,some college,standard,completed,99,87,81
996,996,male,group A,some college,standard,completed,100,96,86
997,997,male,group D,some college,standard,completed,100,97,99
998,998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,999,male,group E,bachelor's degree,standard,completed,100,100,100

In [109]:
df8=data.groupby("index")["math score"]

In [110]:
df8

{0: [0], 1: [1], 2: [2], 3: [3], 4: [4], 5: [5], 6: [6], 7: [7], 8: [8], 9: [9], 10: [10], 11: [11], 12: [12], 13: [13], 14: [14], 15: [15], 16: [16], 17: [17], 18: [18], 19: [19], 20: [20], 21: [21], 22: [22], 23: [23], 24: [24], 25: [25], 26: [26], 27: [27], 28: [28], 29: [29], 30: [30], 31: [31], 32: [32], 33: [33], 34: [34], 35: [35], 36: [36], 37: [37], 38: [38], 39: [39], 40: [40], 41: [41], 42: [42], 43: [43], 44: [44], 45: [45], 46: [46], 47: [47], 48: [48], 49: [49], 50: [50], 51: [51], 52: [52], 53: [53], 54: [54], 55: [55], 56: [56], 57: [57], 58: [58], 59: [59], 60: [60], 61: [61], 62: [62], 63: [63], 64: [64], 65: [65], 66: [66], 67: [67], 68: [68], 69: [69], 70: [70], 71: [71], 72: [72], 73: [73], 74: [74], 75: [75], 76: [76], 77: [77], 78: [78], 79: [79], 80: [80], 81: [81], 82: [82], 83: [83], 84: [84], 85: [85], 86: [86], 87: [87], 88: [88], 89: [89], 90: [90], 91: [91], 92: [92], 93: [93], 94: [94], 95: [95], 96: [96], 97: [97], 98: [98], 99: [99], ...}

In [117]:
df9=data.sort_values(by=['math score'])

In [119]:
df9["index"][0:24]

0        0
1        1
3        3
51      51
2        2
8        8
4        4
20      20
5        5
6        6
40      40
19      19
7        7
18      18
518    518
519    519
11      11
10      10
9        9
520    520
521    521
47      47
522    522
35      35
Name: index, dtype: int64


# These are the index of first 25 students